{
    "data" : [
        {
            "id" : 1,
            "img" : "img1",
            "text" : "Procesor (CPU) to jeden z najważniejszych podzespołów komputerowych. Jego zadaniem jest wymiana informacji między urządzeniami wejścia-wyjścia, kartą graficzną czy pamięcią RAM oraz przetwarzanie danych. Wiodącymi markami procesorów są AMD i Intel. Wydajność procesora określa przede wszystkim liczba rdzeni fizycznych i wątków. Każdy rdzeń fizyczny wykonuje jedno zadanie, dlatego CPU z większą liczbą rdzeni może wykonywać więcej zadań równocześnie. Aby jeszcze bardziej zwiększyć wydajność, producenci dzielą rdzenie fizyczne na wątki, czyli wirtualne wersje rdzenia. Procesory Intel używają w tym celu technologii Hyper-Threading (HT), a procesory AMD - SMT. Obecne procesory Intel mają od 4 do 18 rdzeni, natomiast AMD od 4 do 16 rdzeni."
        },
        {
            "id" : 2,
            "img" : "img2",
            "text" : "Router Wi-Fi to urządzenie sieciowe, które rozdziela sygnał internetowy. Pozwala na jednoczesne korzystanie z usług internetowych z kilku komputerów, smatfonów, tabletów i telewizorów z technologią Smart TV. Większość routerów Wi-Fi posiada od jednego do nawet ośmiu portów LAN, umożliwiających również przewodowe dostęp do sieci w technologii Ethernet. Używają jej m.in. drukarki, laptopy oraz komputery stacjonarne wyposażone w karty sieciowe z gniazdem RJ-45. Sygnał przesyłany jest również bezprzewodowo, zgodnie ze standardami Wi-Fi. Do najpopularniejszych łączy wykorzystywanych przez dostawców internetu należą xDSL oraz ADSL. Z łączy xDSL korzystają sieci lokalne oraz telewizje kablowe (UPC, Vectra). Natomiast routery ADSL są w stanie przetwarzać sygnał telefoniczny, dzięki czemu można korzystać z usług dostawców wykorzystujących ten rodzaj łącza (Neostrada TP, Netia Dialog)."
        },
        {
            "id" : 3,
            "img" : "img3",
            "text" : "Karta graficzna, często też nazywana akceleratorem grafiki, to element komputera generujcy sygnał wizyjny (obraz) dla monitora. Podstawowym zadaniem karty graficznej jest przechowywanie informacji o zawartości ekranu monitora i odpowiednie sterowanie tą zawartością. Współczesne karty graficzne składają sie z wielu złożonych, współpracujących ze sobą komponentów. Procesor graficzny (GPU) jest odpowiedzialny za generowanie obrazu w pamięci obrazu. Pamięć obrazu - VideoRAM (VRAM), bufor ramki (framebuffer) - przechowuje cyfrowe dane obrazu. Pamięć ROM przechowuje dane, jak generator znaków, czy firmware karty graficznej. Zwykle ROM jest w postaci pamięci flash, co umożliwia aktualizację. Przetwornik cyfrowo-analogowy DAC przekształca cyfrowe dane z pamięci obrazu na analogowy sygnał sterujący dla monitora. Złącze umożliwia wymianę danych i sterowanie kartą graficzną - zazwyczaj używane są standardy PCI, AGP lub PCI-Express."
        },
        {
            "id" : 4,
            "img" : "img4",
            "text" : "Mysz to urządzenie wskazujące używane podczas pracy z interfejsem graficznym komputera. Umożliwia poruszanie kursorem po ekranie komputera poprzez przesuwanie po płaskiej powierzchni. Mysz odczytuje zmianę położenia względem podłoża, a po jego zamianie na postać cyfrową komputer dokonuje zmiany położenia kursora myszy na ekranie. Najczęściej wyposażona jest również w kółko do przewijania ekranu. Dawniej mysz była podłączana do komputera PC przez port RS232 lub PS/2, obecnie dominuje złącze USB lub połączenie bezprzewodowe."
        },
        {
            "id" : 5,
            "img" : "img5",
            "text" : "Klawiatura komputerowa jest to uporządkowany zestaw klawiszy służący do ręcznego sterowania urządzeniem lub ręcznego wprowadzania danych. W zależności od spełnianej funkcji klawiatura zawiera różnego rodzaju klawisze – alfabetyczne, numeryczne, znaków specjalnych, funkcji specjalnych, o znaczeniu definiowanym przez użytkownika."
        },
        {
            "id" : 6,
            "img" : "img6",
            "text" : "Płyta główna (ang. motherboard, mainboard) jest to komponent urządzenia elektronicznego w postaci obwodu drukowanego, na którym montuje się najważniejsze elementy. Umożliwia komunikację pomiędzy wszystkimi pozostałymi komponentami i modułami."
        }
    ]
}